'''Напишите программу, которая определяет:
    является ли вводимое целое число число чётным/нечётным;
    положительное/отрицательное/ноль;
    принадлежит ли диапазону [10, 50].'''
number = float(input("Введите число: "))

if number % 2 == 0:
    print(f"Число {number} — чётное")
else:
    print(f"Число {number} — нечётное")

if number > 0:
    print(f"Число {number} — положительное")
elif number < 0:
    print(f"Число {number} — отрицательное")
else:
    print(f"Число {number} — ноль")

if 10 <= number <= 50:
    print(f"Число {number} принадлежит диапазону [10, 50]")
else:
    print(f"Число {number} не принадлежит диапазону [10, 50]")